## Terraform Plan Summary (AWS)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.my_dev_logs_678 will be created
  + resource "aws_s3_bucket" "my_dev_logs_678" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-dev-logs-678"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Owner"       = "selfservice"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Owner"       = "selfservice"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.my_dev_logs_678_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "my_dev_logs_678_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-southeast-2"
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
